{
  "banner": {
    "message": "Mae GOV.UK yn defnyddio cwcis i wneud y safle’n symlach",
    "link": "Darganfyddwch fwy am gwcis"
  },
  "header": "Cwcis",
  "intro": "Mae’r gwasanaeth hwn yn gosod ffeiliau bychan (a elwir yn ‘cwcis’) ar eich cyfrifiadur er mwyn:",
  "intro-list": {
    "items": [
      "cofio pa negeseuon rydych wedi’u gweld fel nad ydynt yn cael eu dangos i chi eto",
      "storio gwybodaeth rydych yn ei roi dros dro i gefnogi eich cais"
    ]
  },
  "intro-list-ga-tag": {
    "items": [
      "cofio pa negeseuon rydych wedi’u gweld fel nad ydynt yn cael eu dangos i chi eto",
      "deall sut rydych yn defnyddio’r gwasanaeth er mwyn i ni allu ei ddiweddaru a’i wella",
      "storio gwybodaeth rydych yn ei roi dros dro i gefnogi eich cais"
    ]
  },
  "indent-intro": {
    "content": "Nid yw’r cwcis a ddefnyddiwn yn eich adnabod yn bersonol."
  },
  "cookies-link": {
    "before": "Darganfyddwch ",
    "href": "http://www.aboutcookies.org/Default.aspx?page=1",
    "link": "sut i reoli cwcis"
  },
  "intro-cookie": "Neges cyflwyno cwcis",
  "intro-cookie-message": "Pan fyddwch yn defnyddio’r gwasanaeth am y tro cyntaf rydym yn dangos ‘neges cwcis’. Yna rydym yn storio cwci ar eich cyfrifiadur fel nad yw’n dangos y neges yma i chi eto.",
  "intro-cookie-table": {
    "headers": [
      "Enw",
      "Pwrpas",
      "Dod i ben"
    ],
    "rows": [
      [
        "seen_cookie_message",
        "Yn gadael i ni wybod eich bod wedi gweld ein neges cwcis yn barod",
        "1 mis"
      ]
    ]
  },
  "measuring-use": "Mesur defnydd o’r safle",
  "google-analytics": [
    "Rydym yn defnyddio Google Analytics i gasglu gwybodaeth am sut rydych chi’n defnyddio\nr gwasanaeth hwn. Mae hyn yn ein helpu i wirio ei fod yn diwallu eich anghenion ac i wneud gwelliannau.",
    "Mae Google Analytics yn storio gwybodaeth am:"
  ],
  "google-analytics-list": {
    "items": [
      "sut wnaethoch chi gyrraedd y safle",
      "tudalennau rydych yn ymweld â hwy a faint o amser rydych yn ei dreulio arnynt",
      "beth rydych yn clicio arno"
    ]
  },
  "no-identify": "Nid oes unrhyw fanylion personol yn cael eu storio gyda’r wybodaeth hon, felly ni ellir eich adnabod.",
  "analytics-table": {
    "headers": [
      "Enw",
      "Pwrpas",
      "Dod i ben"
    ],
    "rows": [
      [
        "_ga",
        "Defnyddir i wahaniaethu defnyddwyr",
        "2 flynedd"
      ],
      [
        "_gat",
        "Defnyddir i wasgu’r gyfradd ceisiadau",
        "10 munud"
      ]
    ]
  },
  "indent-ga": {
    "content": "Ni chaniateir i Google ddefnyddio neu rannu ein data dadansoddol."
  },
  "session-cookies": "Cwcis sesiwn",
  "session-cookies-content": "Mae cwcis sesiwn yn cael eu lawrlwytho bob tro y byddwch yn ymweld â\nr gwasanaeth ac yn cael eu dileu pan fyddwch yn cau eich porwr. Maent yn helpu’r gwasanaeth i weithio’n iawn.",
  "session-cookies-table": {
    "headers": [
      "Enw",
      "Pwrpas",
      "Dod i ben"
    ],
    "rows": [
      [
        "{{cookieName}}",
        "Mae’n Storio ID sesiwn a storio data rydych chi\nn ei gofnodi dros dro i’ch galluogi i wneud cais",
        "Pan fyddwch yn cau eich porwr"
      ],
      [
        "hof-wizard-sc",
        "Mae’n dweud wrthym pan mae eich sesiwn yn dechrau fel ein bod yn gallu dweud wrthych os yw’n dod i ben",
        "Pan fyddwch yn cau eich porwr"
      ],
      [
        "hof-cookie-check",
        "Mae’n dweud wrthym eich bod wedi galluogi cwcis yn barod fel nad oes angen i ni ofyn i chi eto",
        "Pan fyddwch yn cau eich porwr"
      ]
    ]
  }
}
